# На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n]
# Sample
# 5
# [1, 2, 3, 4, 5]

s = int(input())
print(list(range(1,s+1)))