# import pytest

# # d**e**f
# print('d', 'e', 'f', sep='**')

# # a b c@d e f@@
# print('a', 'b', 'c', end='@')
# print('d', 'e', 'f', end='@@')

# # abc
# print('a', 'b', 'c', sep='', end='')

# print(a, b, sep = '\n') # а и b выведутся на новых строках

# ** Возведение в степень
# % Остаток от деления
# // Целочисленное деление

# a = num % 10
# b = (num % 100) // 10
# c = num // 100

# a = (num // 10**3) % 10
# b = (num // 10**2) % 10
# c = (num // 10**1) % 10
# d = (num // 10**0) % 10

# n = int(input())
# a = n // 10000
# b = n % 10000 // 1000
# c = n % 1000 // 100
# d = n % 100 // 10
# e = n % 10
